var rule = {
	title:'苹果DJ',
	host:'http://m.pingguodj.com',
	// url: '/dance/id-fyclass-fypage.html',
	url: '/dance/id-fyfilter-fypage.html',
	filterable:1,//是否启用分类筛选,
	filter_url:'{{fl.cateId}}',
	filter:{
		"video":[{"key":"cateId","name":"类型","value":[{"n":"车载","v":"123"},{"n":"劲爆舞蹈","v":"112"},{"n":"车载音乐","v":"125"},{"n":"超清","v":"12"},{"n":"华语超清MV","v":"31"},{"n":"国外超清MV","v":"44"},{"n":"音乐派对","v":"90"},{"n":"中文抒情","v":"20"},{"n":"泳装舞曲","v":"56"},{"n":"国外酒吧","v":"21"},{"n":"粤语舞曲","v":"114"},{"n":"英文抒情","v":"46"},{"n":"日韩歌曲","v":"50"},{"n":"串烧舞曲","v":"62"},{"n":"钢管舞曲","v":"64"},{"n":"国外DVJ","v":"65"},{"n":"美女小视频","v":"95"},{"n":"炫Money","v":"97"},{"n":"炫飞机","v":"98"},{"n":"炫风景","v":"99"},{"n":"炫海边","v":"100"},{"n":"炫货单","v":"101"},{"n":"炫美女","v":"102"},{"n":"炫美食","v":"103"},{"n":"炫明星","v":"104"},{"n":"炫跑车","v":"105"},{"n":"炫生活","v":"106"},{"n":"炫装逼","v":"107"},{"n":"炫坐船","v":"108"},{"n":"车载视频2","v":"122"},{"n":"酒吧中文","v":"158"},{"n":"户外DJ","v":"159"},{"n":"模特DJ","v":"160"},{"n":"帅哥","v":"96"},{"n":"短视频","v":"94"}]}],
		"music":[{"key":"cateId","name":"类型","value":[{"n":"车载","v":"85"},{"n":"车载3D","v":"116"},{"n":"中文单曲","v":"22"},{"n":"抒情单曲","v":"26"},{"n":"粤语舞曲","v":"29"},{"n":"草原舞曲","v":"35"},{"n":"粤语歌曲","v":"54"},{"n":"中文串烧","v":"63"},{"n":"8倍音乐","v":"136"},{"n":"8倍音质草原","v":"137"},{"n":"国外舞曲","v":"2"},{"n":"国内舞曲","v":"4"},{"n":"国外串烧","v":"6"},{"n":"欧美单曲","v":"13"},{"n":"英文歌曲","v":"30"},{"n":"DutchHouse","v":"36"},{"n":"ElectroHouse","v":"37"},{"n":"Mash Up","v":"38"},{"n":"FunkyHouse","v":"39"},{"n":"Club Dance","v":"40"},{"n":"Club House","v":"41"},{"n":"Pure House","v":"42"},{"n":"Vocal House","v":"43"},{"n":"印度舞曲","v":"47"},{"n":"说唱歌曲","v":"53"},{"n":"club 舞曲","v":"110"},{"n":"蓝调爵士","v":"117"},{"n":"纯音乐","v":"120"},{"n":"无损舞曲","v":"1"},{"n":"无损中文舞曲","v":"16"},{"n":"无损英文舞曲","v":"17"},{"n":"无损中文歌曲","v":"18"},{"n":"无损英文歌曲","v":"19"},{"n":"无损串烧舞曲","v":"33"},{"n":"纯DJ音乐","v":"121"},{"n":"外文3D舞曲","v":"92"},{"n":"中文3D舞曲","v":"93"},{"n":"环绕舞曲","v":"109"},{"n":"交谊舞曲","v":"24"},{"n":"中四","v":"66"},{"n":"并四","v":"67"},{"n":"快四","v":"68"},{"n":"慢四","v":"69"},{"n":"快三","v":"70"},{"n":"中三","v":"71"},{"n":"慢三","v":"72"},{"n":"伦巴","v":"73"},{"n":"恰恰","v":"74"},{"n":"探戈","v":"75"},{"n":"吉特巴","v":"76"},{"n":"摇并","v":"77"},{"n":"桑巴","v":"78"},{"n":"拉丁","v":"79"},{"n":"三步踩","v":"80"},{"n":"广场舞曲","v":"81"},{"n":"自由步","v":"82"},{"n":"中文抒情串烧","v":"27"},{"n":"伴奏舞曲","v":"111"},{"n":"Disco 的士高","v":"115"},{"n":"雷鬼音乐","v":"118"},{"n":"Hip Hop","v":"119"},{"n":"Exclusive","v":"124"},{"n":"Deep 舞曲","v":"126"},{"n":"Deep House","v":"127"},{"n":"HouseFuture","v":"128"},{"n":"House Dance","v":"129"},{"n":"Club Killers","v":"130"},{"n":"BarBangerz","v":"131"},{"n":"Trap 舞曲","v":"132"},{"n":"MyMP3Pool","v":"133"},{"n":"BigRoom","v":"134"},{"n":"Ibiza 舞曲","v":"135"},{"n":"8倍音质国外舞曲","v":"138"},{"n":"华尔兹","v":"139"},{"n":"Crooklyn","v":"140"},{"n":"Dubstep","v":"141"},{"n":"Tits Exclu","v":"143"},{"n":"Chartbusters","v":"144"},{"n":"抖音歌曲","v":"145"},{"n":"Bounce EDM","v":"146"},{"n":"Beezo BeeHive","v":"147"},{"n":"Tech House","v":"148"},{"n":"Headliner","v":"149"},{"n":"Nothing","v":"150"},{"n":"Rock","v":"151"},{"n":"Techno","v":"152"},{"n":"Transition","v":"153"},{"n":"流行歌曲","v":"155"}]}]
	},
	filter_def:{
		video:{cateId:'58'},
		music:{cateId:'145'}
	},
	// searchUrl: '/dance/so/key?#key=**&p=fypage;post',
	searchUrl: '/dance/so/key?key=**&p=fypage',
	searchable:2,
	quickSearch:0,
	headers:{
		'User-Agent': 'MOBILE_UA'
	},
	timeout:5000,//网站的全局请求超时,默认是3000毫秒
	class_name:'🎦热播视频&🎶热播音乐',
	class_url:'video&music',
	play_parse:true,
	lazy:'',
	limit:6,
	推荐: "*",
	一级:"js:pdfh=jsp.pdfh;pdfa=jsp.pdfa;pd=jsp.pd;var d=[];let html=request(input);var list=pdfa(html,'.video&&a');if(/glist1/.test(html)){list=pdfa(html,'.glist1&&li')}list.forEach(function(it){d.push({title:pdfh(it,'img&&alt').strip(),img:getHome(MY_URL)+pdfh(it,'Html').match(/\\/attachment.*?jpg/)[0],url:pd(it,'a&&href')})});setResult(d)",
	二级: "*",
	搜索: "*",
}